<font color ='red'><h4><b>Credit Risk Scoring Project</h4><font>

We want to build a model that for each customer is going to calculate the credit risk based on certain conditions and then will tell use whether the customer will default or will pay the loan back. so a binary classification problem.<br>

Decision tree algorithm is like a rule based algorithm that if this then this and we will learn that how decision tree algorithm comes to know about these routes/rules <br>

We will see what happens if we put different or many more trees together we get the <font color = 'orange'> Random Forest Model</font> <br>

How to combine multiple trees together called <font color = 'orange'> Gradient Boosting</font> using a library called <font color = 'orange'>XGBoost</font> <br>

And finally selecting the best model.

<font color = 'red'><h4> <b>Data Cleaning and Preparation</h4></font>

ðŸ¥½ Download the data from the given link.<br>
ðŸ¥½Reformat categorical columns (status, home, marital, records, and job) by mapping with appropriate values.<br>
ðŸ¥½Replace the maximum value of income, assests, and debt columns with NaNs.<br>
ðŸ¥½Replace the NaNs in the dataframe with 0 (will be shown in the next lesson).<br>
ðŸ¥½Extract only those rows in the column status who are either ok or default as value.<br>
ðŸ¥½Split the data in a two-step process which finally leads to the distribution of 60% train, 20% validation, and 20% test sets with random seed to 11.<br>
ðŸ¥½Prepare target variable status by converting it from categorical to binary, where 0 represents ok and 1 represents default.<br>
ðŸ¥½Finally delete the target variable from the train/val/test dataframe.<br>

In [2]:
import pandas as pd
import numpy as np 
import seaborn as sns
from matplotlib import pyplot as plt

%matplotlib inline

In [3]:
data = 'https://raw.githubusercontent.com/alexeygrigorev/mlbookcamp-code/master/chapter-06-trees/CreditScoring.csv'

df =pd.read_csv(data)

df.head()

,Status,Seniority,Home,Time,Age,Marital,Records,Job,Expenses,Income,Assets,Debt,Amount,Price
0,1,9,1,60,30,2,1,3,73,129,0,0,800,846
1,1,17,1,60,58,3,1,1,48,131,0,0,1000,1658
2,2,10,2,36,46,2,2,3,90,200,3000,0,2000,2985
3,1,0,1,60,24,1,1,1,63,182,2500,0,900,1325
4,1,0,1,36,26,1,1,1,46,107,0,0,310,910

In [4]:
df.columns = df.columns.str.lower()

In [5]:
df.head()

,status,seniority,home,time,age,marital,records,job,expenses,income,assets,debt,amount,price
0,1,9,1,60,30,2,1,3,73,129,0,0,800,846
1,1,17,1,60,58,3,1,1,48,131,0,0,1000,1658
2,2,10,2,36,46,2,2,3,90,200,3000,0,2000,2985
3,1,0,1,60,24,1,1,1,63,182,2500,0,900,1325
4,1,0,1,36,26,1,1,1,46,107,0,0,310,910

In [6]:
#The categorical variable are coded as numerical and that is not what we want to convert it into useful information.
#For that we can use the map method in which we can pass a dictionary indicating what value represents what.

status_values = {
    1:'ok',
    2:'default',
    0:'unk'  #unknown
}

df.status = df.status.map(status_values)

In [7]:
df.head()

,status,seniority,home,time,age,marital,records,job,expenses,income,assets,debt,amount,price
0,ok,9,1,60,30,2,1,3,73,129,0,0,800,846
1,ok,17,1,60,58,3,1,1,48,131,0,0,1000,1658
2,default,10,2,36,46,2,2,3,90,200,3000,0,2000,2985
3,ok,0,1,60,24,1,1,1,63,182,2500,0,900,1325
4,ok,0,1,36,26,1,1,1,46,107,0,0,310,910